amurzeau/damc_stm32f723disco/src/stm32n6570-dk/FSBL/BSP/stm32n6570_discovery_sd.c
/**
  ******************************************************************************
  * @file    stm32n6570_discovery_sd.c
  * @author  MCD Application Team
  * @brief   This file includes the uSD card driver mounted on STM32N6570_DK
  *          boards.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                     ##### How to use this driver #####
  ==============================================================================
   - This driver is used to drive the micro SD external card mounted on the
     STM32N6570_DK board.
   - This driver does not need a specific component driver for the micro SD device
     to be included with.

  Driver description:
  ------------------
  + Initialization steps:
     o Initialize the micro SD card using the BSP_SD_Init() function. This
       function includes the MSP layer hardware resources initialization and the
       SDIO interface configuration to interface with the external micro SD. It
       also includes the micro SD initialization sequence for instance 0.

     o To check the SD card presence you can use the function BSP_SD_IsDetected() which
       returns the detection status for instance 0.

     o If SD presence detection interrupt mode is desired, you must configure the
       SD detection interrupt mode by calling the function BSP_SD_DetectITConfig().
       The interrupt is generated as an external interrupt whenever the micro SD card is
       plugged/unplugged in/from the discovery board.
     The SD detection interrupt is handled by calling the function BSP_SD_DetectIT()
       which is called in the IRQ handler file, the user callback is implemented in
     the function BSP_SD_DetectCallback().

     o The function BSP_SD_GetCardInfo()are used to get the micro SD card information
       which is stored in the structure "HAL_SD_CardInfoTypedef".

  + Micro SD card operations
     o The micro SD card can be accessed with read/write block(s) operations once
       it is ready for access. The access can be performed whether
       using the polling mode by calling the functions BSP_SD_ReadBlocks()/BSP_SD_WriteBlocks(),
       using the interrupt mode by calling the functions BSP_SD_ReadBlocks_IT()/BSP_SD_WriteBlocks_IT(),
       or by DMA transfer using the functions BSP_SD_ReadBlocks_DMA()/BSP_SD_WriteBlocks_DMA().
       The access can be performed to instance 0.

     o The DMA transfer complete is used with interrupt mode. Once the SD transfer
       is complete, the SD interrupt is handled using the function BSP_SD_IRQHandler()
       when instance 0 is used.
       The DMA Tx/Rx transfer complete are handled using the functions
       SD_SDMMC1_DMA_Tx_IRQHandler(), SD_SDMMC1_DMA_Rx_IRQHandler(). The corresponding
       user callbacks are implemented by the user at application level.

     o The SD erase block(s) is performed using the functions BSP_SD_Erase() with specifying
       the number of blocks to erase.

     o The SD runtime status is returned when calling the function BSP_SD_GetCardState().

  @endverbatim
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32n6570_discovery_sd.h"

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32N6570_DK
  * @{
  */

/** @defgroup STM32N6570_DK_SD SD
  * @{
  */

/** @defgroup STM32N6570_DK_SD_Private_TypesDefinitions SD Private TypesDefinitions
  * @{
  */
#if (USE_HAL_SD_REGISTER_CALLBACKS > 0)
/* Is Msp Callbacks registered */
static uint32_t   IsMspCallbacksValid[SD_INSTANCES_NBR] = {0};
#endif /* USE_HAL_SD_REGISTER_CALLBACKS */
typedef void (*BSP_SD_EXTI_LineCallback)(void);
/**
  * @}
  */

/** @defgroup STM32N6570_DK_SD_Exported_Variables SD Exported Variables
  * @{
  */
SD_HandleTypeDef        hsd_sdmmc[SD_INSTANCES_NBR];
EXTI_HandleTypeDef      hsd_exti[SD_INSTANCES_NBR];
/**
  * @}
  */

/** @defgroup STM32N6570_DK_SD_Private_Variables SD Private Variables
  * @{
  */
static uint32_t     PinDetect[SD_INSTANCES_NBR]  = {SD_DETECT_PIN};
static GPIO_TypeDef *SD_GPIO_PORT[SD_INSTANCES_NBR] = {SD_DETECT_GPIO_PORT};
/**
  * @}
  */

/** @defgroup STM32N6570_DK_SD_Private_Functions_Prototypes SD Private Functions Prototypes
  * @{
  */
static void SD_MspInit(SD_HandleTypeDef *hsd);
static void SD_MspDeInit(SD_HandleTypeDef *hsd);
#if (USE_HAL_SD_REGISTER_CALLBACKS > 0)
static void SD_AbortCallback(SD_HandleTypeDef *hsd);
static void SD_TxCpltCallback(SD_HandleTypeDef *hsd);
static void SD_RxCpltCallback(SD_HandleTypeDef *hsd);
#endif /* (USE_HAL_SD_REGISTER_CALLBACKS > 0) */
static void SD_EXTI_Callback(void);
/**
  * @}
  */

/** @defgroup STM32N6570_DK_SD_Exported_Functions SD Exported Functions
  * @{
  */

/**
  * @brief  Initializes the SD card device.
  * @param  Instance      SD Instance
  * @retval BSP status
  */
int32_t BSP_SD_Init(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;
  GPIO_InitTypeDef gpio_init_structure;

  if (Instance >= SD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {


  /* SDMMC1 activation  and security configuration */
  {
    uint32_t RIFSCAddress1 = 0x54024C18; /*  (RIFSC_RIMC_ATTRx) with x = 2 (0x8 :Master index of SDMMC1) */
    uint32_t RIFSCAddress2 = 0x54024C1C; /*  (RIFSC_RIMC_ATTRx) with x = 4 (0xC:Master index of SDMMC2) */

    uint32_t data;
    /*SDMMC1*/
     /* set MPRIV, MSEC and MCID=001 (same CID as CPU) */
     *(uint32_t*)RIFSCAddress1 = 0x00000310;
     /* readback data */
     data = *(uint32_t*)RIFSCAddress1 ;
     (void)data;
     __HAL_RCC_SDMMC1_FORCE_RESET();
     __HAL_RCC_SDMMC1_RELEASE_RESET();
     /* Lines below are useful only for DMA transfer */
     /* SDMMC1 Secure Guard RISUP Index is 53 */
     RIFSCAddress1 = 0x54024014; /* RIFSC_RISC_SECCFGRx with x = 1 */
     data = *(uint32_t*)RIFSCAddress1 ;
     *(uint32_t*)RIFSCAddress1 = data | 0x00200000U;
     /* readback data */
     data = *(uint32_t*)RIFSCAddress1 ;
     (void)data;

    /*SDMMC2*/
     /* set MPRIV, MSEC and MCID=001 (same CID as CPU) */
     *(uint32_t*)RIFSCAddress2 = 0x00000310;
     /* readback data */
     data = *(uint32_t*)RIFSCAddress2 ;
     (void)data;
     __HAL_RCC_SDMMC2_FORCE_RESET();
     __HAL_RCC_SDMMC2_RELEASE_RESET();

     /* Lines below are useful only for DMA transfer */
     /* SDMMC1 Secure Guard RISUP Index is 54 */
     RIFSCAddress2 = 0x54024014; /* RIFSC_RISC_SECCFGRx with x = 1 */
     data = *(uint32_t*)RIFSCAddress2 ;
     *(uint32_t*)RIFSCAddress2 = data | 0x00400000U;
     /* readback data */
     data = *(uint32_t*)RIFSCAddress2 ;
     (void)data;


